#!/usr/bin/env python3
# -*- coding: utf-8 -*-

import sys

if __name__ == '__main__':

    d = int(input("введите число= "))
    m = int(input("введите месяц= "))
    y = int(input("введите год= "))

# в случае с високосным годом
    if y % 4 == 0:
        if d == 1:
            print(f"порядковый номр даты={d}")
        elif m == 2:
            print(f"порядковый номр даты={d+31}")
        elif m == 3:
            print(f"порядковый номр даты={d+60}")
        elif m == 4:
            print(f"порядковый номр даты={d+91}")
        elif m == 5:
            print(f"порядковый номр даты={d+121}")
        elif m == 6:
            print(f"порядковый номр даты={d+152}")
        elif m == 7:
            print(f"порядковый номр даты={d+182}")
        elif m == 8:
            print(f"порядковый номр даты={d+213}")
        elif m == 9:
            print(f"порядковый номр даты={d+244}")
        elif m == 10:
            print(f"порядковый номр даты={d+274}")
        elif m == 11:
            print(f"порядковый номр даты={d+305}")
        elif m == 12:
            print(f"порядковый номр даты={d+335}")
        else:
            print("Ошибка!", file=sys.stderr)
            exit(1)
# в случае с невисокосным годом
    else:
        if m == 1:
            print(f"порядковый номр даты={d}")
        elif m == 2:
            print(f"порядковый номр даты={d+31}")
        elif m == 3:
            print(f"порядковый номр даты={d+59}")
        elif m == 4:
            print(f"порядковый номр даты={d+90}")
        elif m == 5:
            print(f"порядковый номр даты={d+120}")
        elif m == 6:
            print(f"порядковый номр даты={d+151}")
        elif m == 7:
            print(f"порядковый номр даты={d+181}")
        elif m == 8:
            print(f"порядковый номр даты={d+212}")
        elif m == 9:
            print(f"порядковый номр даты={d+243}")
        elif m == 10:
            print(f"порядковый номр даты={d+273}")
        elif m == 11:
            print(f"порядковый номр даты={d+304}")
        elif m == 12:
            print(f"порядковый номр даты={d+334}")
        else:
            print("Ошибка!", file=sys.stderr)
            exit(1)